; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p9---int100n150-m25---int100c200---s108---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 - fuellevel
)

(:init
(sum level0 level11 level11)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level1 level11 level12)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level2 level11 level13)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level3 level11 level14)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level4 level11 level15)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level5 level11 level16)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level6 level11 level17)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level7 level11 level18)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level8 level11 level19)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level9 level11 level20)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level10 level11 level21)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level11 level11 level22)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level12 level11 level23)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level13 level11 level24)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level14 level11 level25)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level15 level11 level26)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level16 level11 level27)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level17 level11 level28)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level18 level11 level29)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level19 level11 level30)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level20 level11 level31)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level21 level11 level32)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level22 level11 level33)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level23 level11 level34)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level24 level11 level35)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level25 level11 level36)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level26 level11 level37)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level27 level11 level38)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level28 level11 level39)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level29 level11 level40)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level30 level11 level41)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level31 level11 level42)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level32 level11 level43)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level33 level11 level44)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level34 level11 level45)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level35 level11 level46)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level36 level11 level47)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level37 level11 level48)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level38 level11 level49)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level39 level11 level50)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level40 level11 level51)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level41 level11 level52)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level42 level11 level53)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level43 level11 level54)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level44 level11 level55)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level45 level11 level56)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level46 level11 level57)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level47 level11 level58)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level48 level11 level59)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level49 level11 level60)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level50 level11 level61)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level51 level11 level62)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level52 level11 level63)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level53 level11 level64)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level54 level11 level65)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level55 level11 level66)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level56 level11 level67)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level57 level11 level68)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level58 level11 level69)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level59 level11 level70)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level60 level11 level71)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level61 level11 level72)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level62 level11 level73)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level63 level11 level74)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level64 level11 level75)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level65 level11 level76)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level66 level11 level77)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level67 level11 level78)
(sum level67 level19 level86)
(sum level67 level20 level87)
(sum level68 level11 level79)
(sum level68 level19 level87)
(sum level68 level20 level88)
(sum level69 level11 level80)
(sum level69 level19 level88)
(sum level69 level20 level89)
(sum level70 level11 level81)
(sum level70 level19 level89)
(sum level70 level20 level90)
(sum level71 level11 level82)
(sum level71 level19 level90)
(sum level71 level20 level91)
(sum level72 level11 level83)
(sum level72 level19 level91)
(sum level72 level20 level92)
(sum level73 level11 level84)
(sum level73 level19 level92)
(sum level73 level20 level93)
(sum level74 level11 level85)
(sum level74 level19 level93)
(sum level74 level20 level94)
(sum level75 level11 level86)
(sum level75 level19 level94)
(sum level75 level20 level95)
(sum level76 level11 level87)
(sum level76 level19 level95)
(sum level76 level20 level96)
(sum level77 level11 level88)
(sum level77 level19 level96)
(sum level77 level20 level97)
(sum level78 level11 level89)
(sum level78 level19 level97)
(sum level78 level20 level98)
(sum level79 level11 level90)
(sum level79 level19 level98)
(sum level79 level20 level99)
(sum level80 level11 level91)
(sum level80 level19 level99)
(sum level80 level20 level100)
(sum level81 level11 level92)
(sum level81 level19 level100)
(sum level81 level20 level101)
(sum level82 level11 level93)
(sum level82 level19 level101)
(sum level82 level20 level102)
(sum level83 level11 level94)
(sum level83 level19 level102)
(sum level83 level20 level103)
(sum level84 level11 level95)
(sum level84 level19 level103)
(sum level84 level20 level104)
(sum level85 level11 level96)
(sum level85 level19 level104)
(sum level85 level20 level105)
(sum level86 level11 level97)
(sum level86 level19 level105)
(sum level86 level20 level106)
(sum level87 level11 level98)
(sum level87 level19 level106)
(sum level87 level20 level107)
(sum level88 level11 level99)
(sum level88 level19 level107)
(sum level88 level20 level108)
(sum level89 level11 level100)
(sum level89 level19 level108)
(sum level89 level20 level109)
(sum level90 level11 level101)
(sum level90 level19 level109)
(sum level90 level20 level110)
(sum level91 level11 level102)
(sum level91 level19 level110)
(sum level91 level20 level111)
(sum level92 level11 level103)
(sum level92 level19 level111)
(sum level92 level20 level112)
(sum level93 level11 level104)
(sum level93 level19 level112)
(sum level93 level20 level113)
(sum level94 level11 level105)
(sum level94 level19 level113)
(sum level94 level20 level114)
(sum level95 level11 level106)
(sum level95 level19 level114)
(sum level95 level20 level115)
(sum level96 level11 level107)
(sum level96 level19 level115)
(sum level96 level20 level116)
(sum level97 level11 level108)
(sum level97 level19 level116)
(sum level97 level20 level117)
(sum level98 level11 level109)
(sum level98 level19 level117)
(sum level98 level20 level118)
(sum level99 level11 level110)
(sum level99 level19 level118)
(sum level99 level20 level119)
(sum level100 level11 level111)
(sum level100 level19 level119)
(sum level100 level20 level120)
(sum level101 level11 level112)
(sum level101 level19 level120)
(sum level101 level20 level121)
(sum level102 level11 level113)
(sum level102 level19 level121)
(sum level102 level20 level122)
(sum level103 level11 level114)
(sum level103 level19 level122)
(sum level104 level11 level115)
(sum level105 level11 level116)
(sum level106 level11 level117)
(sum level107 level11 level118)
(sum level108 level11 level119)
(sum level109 level11 level120)
(sum level110 level11 level121)
(sum level111 level11 level122)

(connected l0 l1)
(fuelcost level19 l0 l1)
(connected l0 l2)
(fuelcost level20 l0 l2)
(connected l1 l0)
(fuelcost level19 l1 l0)
(connected l1 l2)
(fuelcost level11 l1 l2)
(connected l2 l0)
(fuelcost level20 l2 l0)
(connected l2 l1)
(fuelcost level11 l2 l1)

(at t0 l1)
(fuel t0 level122)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l1)
(at p3 l0)
(at p4 l1)
(at p5 l1)
(at p6 l2)
(at p7 l1)
(at p8 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l2)
(at p4 l2)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 9
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 9
3. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 9
4. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 9
5. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 9
6. (drive t0 l1 l2 level111 level11 level122)
   deleted: (at t0 l1) (fuel t0 level122)
   added: (at t0 l2) (fuel t0 level111)
   goals met: 0 of 9
7. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 9
8. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 9
9. (drive t0 l2 l0 level91 level20 level111)
   deleted: (at t0 l2) (fuel t0 level111)
   added: (at t0 l0) (fuel t0 level91)
   goals met: 0 of 9
10. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 1 of 9
11. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 2 of 9
12. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 3 of 9
13. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 4 of 9
14. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 4 of 9
15. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 4 of 9
16. (drive t0 l0 l1 level72 level19 level91)
   deleted: (at t0 l0) (fuel t0 level91)
   added: (at t0 l1) (fuel t0 level72)
   goals met: 4 of 9
17. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 5 of 9
18. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 6 of 9
19. (drive t0 l1 l2 level61 level11 level72)
   deleted: (at t0 l1) (fuel t0 level72)
   added: (at t0 l2) (fuel t0 level61)
   goals met: 6 of 9
20. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 7 of 9
21. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 8 of 9
22. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 9 of 9
